Internship Domain Wise Task 2

1. Prepare the Titanic dataset file (download it from Google)
2. Find out the names of passengers younger than 35 years.
3. Print the rows from index 10 to 25 and columns 3 to 5
4. Find out the statistics aggregate of Age & Fare using the DataFrame.agg() method
5. Find out the mean ticket fare price for each of the sex and cabin class combinations

### Task 1 : Prepare the Titanic dataset

In [1]:
import pandas as pd

In [2]:
titanic = pd.read_csv("C:\\Users\\YOGESH ASMAR\\Desktop\\Internship\\Assignment 2\\titanic_train.csv")

In [3]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Task 2 : Find out the names of passengers younger than 35 years.

In [5]:
df_age35 = titanic[titanic["Age"]<35]

In [7]:
df_age35.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

### Task 3 : Print the rows from index 10 to 25 and columns 3 to 5

In [54]:
titanic.iloc[10:25, 3:5]

                                                 Name     Sex
10                    Sandstrom, Miss. Marguerite Rut  female
11                           Bonnell, Miss. Elizabeth  female
12                     Saundercock, Mr. William Henry    male
13                        Andersson, Mr. Anders Johan    male
14               Vestrom, Miss. Hulda Amanda Adolfina  female
15                   Hewlett, Mrs. (Mary D Kingcome)   female
16                               Rice, Master. Eugene    male
17                       Williams, Mr. Charles Eugene    male
18  Vander Planke, Mrs. Julius (Emelia Maria Vande...  female
19                            Masselmani, Mrs. Fatima  female
20                               Fynney, Mr. Joseph J    male
21                              Beesley, Mr. Lawrence    male
22                        McGowan, Miss. Anna "Annie"  female
23                       Sloper, Mr. William Thompson    male
24                      Palsson, Miss. Torborg Danira  female

### Task 4 : Find out the statistics aggregate of Age & Fare using the DataFrame.agg() method

In [16]:
avg_age_fare = titanic[["Age","Fare"]].mean()

In [17]:
avg_age_fare

Age     29.699118
Fare    32.204208
dtype: float64

In [18]:
med_age_fare = titanic[["Age","Fare"]].median()

In [19]:
med_age_fare

Age     28.0000
Fare    14.4542
dtype: float64

In [20]:
agg_stat = titanic[["Age","Fare"]].describe()

In [21]:
agg_stat

              Age        Fare
count  714.000000  891.000000
mean    29.699118   32.204208
std     14.526497   49.693429
min      0.420000    0.000000
25%     20.125000    7.910400
50%     28.000000   14.454200
75%     38.000000   31.000000
max     80.000000  512.329200

### Task 5 : Find out the mean ticket fare price for each of the sex and cabin class combinations

In [39]:
sex_fare =  titanic[["Fare","Sex"]].groupby("Sex").mean()

In [40]:
sex_fare

             Fare
Sex
female  44.479818
male    25.523893

In [58]:
cabin_fare =  titanic.groupby(["Sex", "Pclass"])["Fare"].mean()

In [53]:
cabin_fare

Sex     Pclass
female  1         106.125798
        2          21.970121
        3          16.118810
male    1          67.226127
        2          19.741782
        3          12.661633
Name: Fare, dtype: float64